<template>
  <div class="side-bar custom-scrollbar">
    <div class="px-4 py-5 flex items-center border-b border-borderColor">
      <router-link :to="{ name: 'home' }" class="text-primaryColor">
        <svg xmlns="http://www.w3.org/2000/svg" width="136" height="32" viewBox="0 0 117 31" fill="currentColor">
          <path
            class="tokoo-svg"
            d="M24.471,26.8L22.72,6.809a0.847,0.847,0,0,0-.838-0.78h-3.6a6.041,6.041,0,0,0-12.083,0H2.6a0.843,0.843,0,0,0-.838.78L0.006,26.8c0,0.026-.006.05-0.006,0.076A4.381,4.381,0,0,0,4.59,31h15.3a4.381,4.381,0,0,0,4.59-4.126A0.309,0.309,0,0,0,24.471,26.8ZM12.239,1.712a4.386,4.386,0,0,1,4.353,4.317H7.886A4.385,4.385,0,0,1,12.239,1.712Zm7.648,27.576H4.59a2.7,2.7,0,0,1-2.9-2.377L3.365,7.747H6.191v2.6a0.844,0.844,0,1,0,1.688,0v-2.6h8.712v2.6a0.844,0.844,0,1,0,1.689,0v-2.6h2.827l1.682,19.164A2.709,2.709,0,0,1,19.887,29.288Zm24.472-.042h1.26a1.533,1.533,0,0,0,1.188-.47,1.766,1.766,0,0,0,0-2.315,1.535,1.535,0,0,0-1.188-.47h-1.26a2.793,2.793,0,0,1-1.962-.543,2.506,2.506,0,0,1-.558-1.844v-8.68h4.393a0.882,0.882,0,0,0,.756-0.416,1.861,1.861,0,0,0,0-1.989,0.883,0.883,0,0,0-.756-0.416H41.839V5.485a1.03,1.03,0,0,0-.594-0.868,2.483,2.483,0,0,0-1.314-.362,2.389,2.389,0,0,0-1.3.362,1.031,1.031,0,0,0-.576.868V23.6q0,5.642,6.3,5.642h0Zm6.877-1.881a7.323,7.323,0,0,0,10.424-.018,6.805,6.805,0,0,0,2.251-5.009V19.011A6.677,6.677,0,0,0,61.679,14,7.521,7.521,0,0,0,51.2,14.02,6.745,6.745,0,0,0,49,19.011v3.327A6.808,6.808,0,0,0,51.237,27.366Zm1.548-8.343a3.683,3.683,0,0,1,1.08-2.587,3.477,3.477,0,0,1,5.167,0,3.653,3.653,0,0,1,1.1,2.587v3.305a3.755,3.755,0,0,1-1.1,2.641,3.442,3.442,0,0,1-5.167,0,3.786,3.786,0,0,1-1.08-2.641V19.022Zm15,9.826a2.1,2.1,0,0,0,1.314.4,2.346,2.346,0,0,0,1.368-.4,1.1,1.1,0,0,0,.576-0.868V23.46l2.629-2.387,5.293,7.848a1.2,1.2,0,0,0,1.008.543,2.166,2.166,0,0,0,1.4-.633,1.761,1.761,0,0,0,.72-1.284,1.17,1.17,0,0,0-.216-0.651l-5.653-8.174,4.645-4.159a1.084,1.084,0,0,0,.324-0.8,1.691,1.691,0,0,0-.612-1.23,1.807,1.807,0,0,0-1.224-.579,1.075,1.075,0,0,0-.792.325l-7.526,6.944V3.134a1.018,1.018,0,0,0-.558-0.886A2.6,2.6,0,0,0,69.1,1.9a2.325,2.325,0,0,0-1.332.344,1.034,1.034,0,0,0-.5.886V27.98A1.108,1.108,0,0,0,67.782,28.848ZM85.7,27.366a7.323,7.323,0,0,0,10.424-.018,6.805,6.805,0,0,0,2.25-5.009V19.011A6.677,6.677,0,0,0,96.137,14a7.521,7.521,0,0,0-10.478.018,6.745,6.745,0,0,0-2.2,4.991v3.327A6.807,6.807,0,0,0,85.7,27.366Zm1.548-8.343a3.683,3.683,0,0,1,1.08-2.587,3.477,3.477,0,0,1,5.167,0,3.654,3.654,0,0,1,1.1,2.587v3.305a3.755,3.755,0,0,1-1.1,2.641,3.442,3.442,0,0,1-5.167,0,3.786,3.786,0,0,1-1.08-2.641V19.022Zm15.987,8.343a7.323,7.323,0,0,0,10.424-.018,6.8,6.8,0,0,0,2.25-5.009V19.011A6.677,6.677,0,0,0,113.673,14a7.521,7.521,0,0,0-10.478.018,6.744,6.744,0,0,0-2.2,4.991v3.327A6.807,6.807,0,0,0,103.231,27.366Zm1.548-8.343a3.683,3.683,0,0,1,1.08-2.587,3.477,3.477,0,0,1,5.167,0,3.653,3.653,0,0,1,1.1,2.587v3.305a3.754,3.754,0,0,1-1.1,2.641,3.442,3.442,0,0,1-5.167,0,3.787,3.787,0,0,1-1.08-2.641V19.022Z"
          ></path>
        </svg>
      </router-link>
    </div>
    <div class="px-4 py-5 border-b border-borderColor">
      <ul>
        <li v-if="isAdmin || isStore" :class="{ active: isActive('home') }">
          <router-link :to="{ name: 'home' }">
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 16 16" fill="none" class="mb-[2px]">
              <path d="M1 6V15H6V11C6 9.89543 6.89543 9 8 9C9.10457 9 10 9.89543 10 11V15H15V6L8 0L1 6Z" fill="currentColor" />
            </svg>
            Bảng điều khiển</router-link
          >
        </li>
        <li v-if="isAdmin" :class="{ active: isActive('categories') }">
          <router-link :to="{ name: 'categories' }">
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" fill="none">
              <path
                d="M7.24 2H5.34C3.15 2 2 3.15 2 5.33V7.23C2 9.41 3.15 10.56 5.33 10.56H7.23C9.41 10.56 10.56 9.41 10.56 7.23V5.33C10.57 3.15 9.42 2 7.24 2Z"
                fill="currentColor"
              />
              <path
                d="M18.6695 2H16.7695C14.5895 2 13.4395 3.15 13.4395 5.33V7.23C13.4395 9.41 14.5895 10.56 16.7695 10.56H18.6695C20.8495 10.56 21.9995 9.41 21.9995 7.23V5.33C21.9995 3.15 20.8495 2 18.6695 2Z"
                fill="currentColor"
              />
              <path
                d="M18.6695 13.4297H16.7695C14.5895 13.4297 13.4395 14.5797 13.4395 16.7597V18.6597C13.4395 20.8397 14.5895 21.9897 16.7695 21.9897H18.6695C20.8495 21.9897 21.9995 20.8397 21.9995 18.6597V16.7597C21.9995 14.5797 20.8495 13.4297 18.6695 13.4297Z"
                fill="currentColor"
              />
              <path
                d="M7.24 13.4297H5.34C3.15 13.4297 2 14.5797 2 16.7597V18.6597C2 20.8497 3.15 21.9997 5.33 21.9997H7.23C9.41 21.9997 10.56 20.8497 10.56 18.6697V16.7697C10.57 14.5797 9.42 13.4297 7.24 13.4297Z"
                fill="currentColor"
              />
            </svg>
            Danh mục</router-link
          >
        </li>
        <li v-if="isAdmin" :class="{ active: isActive('stores') }">
          <router-link :to="{ name: 'stores' }">
            <svg xmlns="http://www.w3.org/2000/svg" fill="currentColor" viewBox="0 0 24 24">
              <path
                d="M21.026,6.105a3.1,3.1,0,0,1-2.365,3.848A3.031,3.031,0,0,1,15.1,7.222l-.042-.5A3.03,3.03,0,0,1,12.041,10h-.082A3.03,3.03,0,0,1,8.94,6.719l-.031.375a3.121,3.121,0,0,1-2.83,2.9A3.03,3.03,0,0,1,2.941,6.236l.87-3.479A1,1,0,0,1,4.781,2H19.219a1,1,0,0,1,.97.757ZM18.121,12A5.021,5.021,0,0,0,20,11.631V21a1,1,0,0,1-1,1H5a1,1,0,0,1-1-1V11.631a4.914,4.914,0,0,0,4.907-.683A5.131,5.131,0,0,0,12.042,12a5.027,5.027,0,0,0,3.051-1.052A4.977,4.977,0,0,0,18.121,12ZM14,17a2,2,0,0,0-4,0v3h4Z"
              />
            </svg>
            Store</router-link
          >
        </li>
        <li v-if="isAdmin" :class="{ active: isActive('request-store') }">
          <router-link :to="{ name: 'request-store' }">
            <svg xmlns="http://www.w3.org/2000/svg" fill="currentColor" viewBox="0 0 16 16" id="request-approval-16px">
              <path
                id="Path_47"
                data-name="Path 47"
                d="M-19,12a2,2,0,0,0,2-2,2,2,0,0,0-2-2,2,2,0,0,0-2,2A2,2,0,0,0-19,12Zm0-3a1,1,0,0,1,1,1,1,1,0,0,1-1,1,1,1,0,0,1-1-1A1,1,0,0,1-19,9Zm2.5,4h-5A2.5,2.5,0,0,0-24,15.5,1.5,1.5,0,0,0-22.5,17h7A1.5,1.5,0,0,0-14,15.5,2.5,2.5,0,0,0-16.5,13Zm1,3h-7a.5.5,0,0,1-.5-.5A1.5,1.5,0,0,1-21.5,14h5A1.5,1.5,0,0,1-15,15.5.5.5,0,0,1-15.5,16ZM-8,3.5v5A2.5,2.5,0,0,1-10.5,11h-2.793l-1.853,1.854A.5.5,0,0,1-15.5,13a.489.489,0,0,1-.191-.038A.5.5,0,0,1-16,12.5v-2a.5.5,0,0,1,.5-.5.5.5,0,0,1,.5.5v.793l1.146-1.147A.5.5,0,0,1-13.5,10h3A1.5,1.5,0,0,0-9,8.5v-5A1.5,1.5,0,0,0-10.5,2h-7A1.5,1.5,0,0,0-19,3.5v3a.5.5,0,0,1-.5.5.5.5,0,0,1-.5-.5v-3A2.5,2.5,0,0,1-17.5,1h7A2.5,2.5,0,0,1-8,3.5Zm-6.854,4.354-2-2a.5.5,0,0,1,0-.708.5.5,0,0,1,.708,0L-14.5,6.793l2.646-2.647a.5.5,0,0,1,.708,0,.5.5,0,0,1,0,.708l-3,3A.5.5,0,0,1-14.5,8,.5.5,0,0,1-14.854,7.854Z"
                transform="translate(24 -1)"
              />
            </svg>
            Yêu cầu bán hàng</router-link
          >
        </li>
        <li v-if="isStore" :class="{ active: isActive('products') }">
          <router-link :to="{ name: 'products' }">
            <svg xmlns="http://www.w3.org/2000/svg" fill="currentColor" viewBox="0 0 24 24">
              <g>
                <g>
                  <path
                    d="M20,0H4C1.794,0,0,1.794,0,4v16c0,2.206,1.794,4,4,4h16c2.206,0,4-1.794,4-4V4C24,1.794,22.206,0,20,0z M22,20    c0,1.104-0.896,2-2,2H4c-1.103,0-2-0.896-2-2V4c0-1.103,0.897-2,2-2h16c1.104,0,2,0.897,2,2V20z"
                  />
                  <path d="M18.5,7h-13c-0.552,0-1,0.448-1,1s0.448,1,1,1h13c0.552,0,1-0.448,1-1S19.052,7,18.5,7z" />
                  <path d="M18.5,11h-13c-0.552,0-1,0.448-1,1s0.448,1,1,1h13c0.552,0,1-0.448,1-1S19.052,11,18.5,11z" />
                  <path d="M12,15H5.5c-0.552,0-1,0.448-1,1s0.448,1,1,1H12c0.552,0,1-0.448,1-1S12.552,15,12,15z" />
                </g>
              </g>
            </svg>
            Danh sách sản phẩm</router-link
          >
        </li>

        <li v-if="isStore" :class="{ active: isActive('create-product') }">
          <router-link :to="{ name: 'create-product' }">
            <svg xmlns="http://www.w3.org/2000/svg" fill="currentColor" viewBox="0 0 256 256" id="Flat">
              <path
                d="M229.65137,58.34326l-32-32a8.00034,8.00034,0,0,0-11.31446,0l-96,96A8.00035,8.00035,0,0,0,87.99414,128v32a8.00039,8.00039,0,0,0,8,8h32a8.00076,8.00076,0,0,0,5.65723-2.34326l96-96A8,8,0,0,0,229.65137,58.34326Zm-29.657,18.34326L179.30811,56l12.686-12.68652L212.68066,64ZM223.99414,120v88a16.01833,16.01833,0,0,1-16,16h-160a16.01833,16.01833,0,0,1-16-16V48a16.01833,16.01833,0,0,1,16-16h88a8,8,0,0,1,0,16h-88V208h160V120a8,8,0,0,1,16,0Z"
              />
            </svg>
            Thêm sản phẩm</router-link
          >
        </li>
        <li v-if="isStore" :class="{ active: isActive('inventory') }">
          <router-link :to="{ name: 'inventory' }">
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" fill="none">
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M0 4.6A2.6 2.6 0 0 1 2.6 2h18.8A2.6 2.6 0 0 1 24 4.6v.8A2.6 2.6 0 0 1 21.4 8H21v10.6c0 1.33-1.07 2.4-2.4 2.4H5.4C4.07 21 3 19.93 3 18.6V8h-.4A2.6 2.6 0 0 1 0 5.4v-.8ZM2.6 4a.6.6 0 0 0-.6.6v.8a.6.6 0 0 0 .6.6h18.8a.6.6 0 0 0 .6-.6v-.8a.6.6 0 0 0-.6-.6H2.6ZM8 10a1 1 0 1 0 0 2h8a1 1 0 1 0 0-2H8Z"
                fill="currentColor"
              />
            </svg>
            Kho</router-link
          >
        </li>
        <li v-if="isStore" :class="{ active: isActive('orders') }">
          <router-link :to="{ name: 'orders' }">
            <svg
              xmlns="http://www.w3.org/2000/svg"
              viewBox="0 0 24 24"
              fill="none"
              stroke="currentColor"
              stroke-width="2"
              stroke-linecap="round"
              stroke-linejoin="round"
            >
              <path d="M6 2L3 6v14a2 2 0 002 2h14a2 2 0 002-2V6l-3-4z" />
              <line x1="3" y1="6" x2="21" y2="6" />
              <path d="M16 10a4 4 0 01-8 0" />
            </svg>
            Đơn hàng</router-link
          >
        </li>
        <li v-if="isShipper" :class="{ active: isActive('shipping') }">
          <router-link :to="{ name: 'shipping' }">
            <svg xmlns="http://www.w3.org/2000/svg" fill="currentColor" viewBox="0 -64 640 640">
              <path
                d="M624 352h-16V243.9c0-12.7-5.1-24.9-14.1-33.9L494 110.1c-9-9-21.2-14.1-33.9-14.1H416V48c0-26.5-21.5-48-48-48H112C85.5 0 64 21.5 64 48v48H8c-4.4 0-8 3.6-8 8v16c0 4.4 3.6 8 8 8h272c4.4 0 8 3.6 8 8v16c0 4.4-3.6 8-8 8H40c-4.4 0-8 3.6-8 8v16c0 4.4 3.6 8 8 8h208c4.4 0 8 3.6 8 8v16c0 4.4-3.6 8-8 8H8c-4.4 0-8 3.6-8 8v16c0 4.4 3.6 8 8 8h208c4.4 0 8 3.6 8 8v16c0 4.4-3.6 8-8 8H64v128c0 53 43 96 96 96s96-43 96-96h128c0 53 43 96 96 96s96-43 96-96h48c8.8 0 16-7.2 16-16v-32c0-8.8-7.2-16-16-16zM160 464c-26.5 0-48-21.5-48-48s21.5-48 48-48 48 21.5 48 48-21.5 48-48 48zm320 0c-26.5 0-48-21.5-48-48s21.5-48 48-48 48 21.5 48 48-21.5 48-48 48zm80-208H416V144h44.1l99.9 99.9V256z"
              />
            </svg>
            Vận chuyển</router-link
          >
        </li>
        <li v-if="isStore" :class="{ active: isActive('purchase') }">
          <router-link :to="{ name: 'purchase' }"
            ><svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24">
              <path
                fill="none"
                d="M12 4c-4.411 0-8 3.589-8 8s3.589 8 8 8 8-3.589 8-8-3.589-8-8-8zm1 12.915V18h-2v-1.08c-2.339-.367-3-2.002-3-2.92h2c.011.143.159 1 2 1 1.38 0 2-.585 2-1 0-.324 0-1-2-1-3.48 0-4-1.88-4-3 0-1.288 1.029-2.584 3-2.915V6.012h2v1.109c1.734.41 2.4 1.853 2.4 2.879h-1l-1 .018C13.386 9.638 13.185 9 12 9c-1.299 0-2 .516-2 1 0 .374 0 1 2 1 3.48 0 4 1.88 4 3 0 1.288-1.029 2.584-3 2.915z"
              />
              <path
                fill="currentColor"
                d="M12 2C6.486 2 2 6.486 2 12s4.486 10 10 10 10-4.486 10-10S17.514 2 12 2zm0 18c-4.411 0-8-3.589-8-8s3.589-8 8-8 8 3.589 8 8-3.589 8-8 8z"
              />
              <path
                fill="currentColor"
                d="M12 11c-2 0-2-.626-2-1 0-.484.701-1 2-1 1.185 0 1.386.638 1.4 1.018l1-.018h1c0-1.026-.666-2.469-2.4-2.879V6.012h-2v1.073C9.029 7.416 8 8.712 8 10c0 1.12.52 3 4 3 2 0 2 .676 2 1 0 .415-.62 1-2 1-1.841 0-1.989-.857-2-1H8c0 .918.661 2.553 3 2.92V18h2v-1.085c1.971-.331 3-1.627 3-2.915 0-1.12-.52-3-4-3z"
              />
            </svg>
            Thanh toán</router-link
          >
        </li>
        <li v-if="isAdmin" :class="{ active: isActive('accounts') }">
          <router-link :to="{ name: 'accounts' }">
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" fill="none">
              <path
                d="M17.5 21.0001H6.5C5.11929 21.0001 4 19.8808 4 18.5001C4 14.4194 10 14.5001 12 14.5001C14 14.5001 20 14.4194 20 18.5001C20 19.8808 18.8807 21.0001 17.5 21.0001Z"
                stroke="currentColor"
                stroke-width="2"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
              <path
                d="M12 11C14.2091 11 16 9.20914 16 7C16 4.79086 14.2091 3 12 3C9.79086 3 8 4.79086 8 7C8 9.20914 9.79086 11 12 11Z"
                stroke="currentColor"
                stroke-width="2"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
            </svg>
            Tài khoản</router-link
          >
        </li>

        <li v-if="isStore" :class="{ active: isActive('reviews') }">
          <router-link :to="{ name: 'reviews' }">
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512">
              <g>
                <path
                  fill="currentColor"
                  d="M92.574,294.24V124.336H43.277C19.449,124.336,0,144.213,0,168.467v206.44   c0,24.254,19.449,44.133,43.277,44.133h62v45.469c0,3.041,1.824,5.777,4.559,6.932c2.736,1.154,5.957,0.486,8.023-1.641   l49.844-50.76h106.494c23.828,0,43.279-19.879,43.279-44.133v-0.061H172.262C128.314,374.846,92.574,338.676,92.574,294.24z"
                />
                <path
                  fill="currentColor"
                  d="M462.717,40H172.26c-27.105,0-49.283,22.59-49.283,50.197v204.037c0,27.61,22.178,50.199,49.283,50.199   h164.668l75.348,76.033c2.399,2.442,6.004,3.172,9.135,1.852c3.133-1.322,5.176-4.434,5.176-7.887v-69.998h36.131   c27.106,0,49.283-22.59,49.283-50.199V90.197C512,62.59,489.822,40,462.717,40z M369.156,280.115H195.92v-24.316h173.236V280.115z    M439.058,204.129H195.92v-24.314h243.138V204.129z M439.058,128.143H195.92v-24.315h243.138V128.143z"
                />
              </g>
            </svg>
            Đánh giá</router-link
          >
        </li>
        <li v-if="isAdmin || isStore" :class="{ active: isActive('statistic') }">
          <router-link :to="{ name: 'statistic' }">
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24">
              <path
                d="M7,12v9a1,1,0,0,1-1,1H3a1,1,0,0,1-1-1V12a1,1,0,0,1,1-1H6A1,1,0,0,1,7,12ZM21,6H18a1,1,0,0,0-1,1V21a1,1,0,0,0,1,1h3a1,1,0,0,0,1-1V7A1,1,0,0,0,21,6ZM13.5,2h-3a1,1,0,0,0-1,1V21a1,1,0,0,0,1,1h3a1,1,0,0,0,1-1V3A1,1,0,0,0,13.5,2Z"
                fill="currentColor"
              />
            </svg>
            Thống kê</router-link
          >
        </li>
      </ul>
    </div>
    <div class="px-4 py-5">
      <ul>
        <li :class="{ active: isActive('setting') }">
          <router-link :to="{ name: 'setting' }">
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" fill="none">
              <path
                d="M12 15C13.6569 15 15 13.6569 15 12C15 10.3431 13.6569 9 12 9C10.3431 9 9 10.3431 9 12C9 13.6569 10.3431 15 12 15Z"
                stroke="currentColor"
                stroke-width="2"
                stroke-miterlimit="10"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
              <path
                d="M2 12.8799V11.1199C2 10.0799 2.85 9.21994 3.9 9.21994C5.71 9.21994 6.45 7.93994 5.54 6.36994C5.02 5.46994 5.33 4.29994 6.24 3.77994L7.97 2.78994C8.76 2.31994 9.78 2.59994 10.25 3.38994L10.36 3.57994C11.26 5.14994 12.74 5.14994 13.65 3.57994L13.76 3.38994C14.23 2.59994 15.25 2.31994 16.04 2.78994L17.77 3.77994C18.68 4.29994 18.99 5.46994 18.47 6.36994C17.56 7.93994 18.3 9.21994 20.11 9.21994C21.15 9.21994 22.01 10.0699 22.01 11.1199V12.8799C22.01 13.9199 21.16 14.7799 20.11 14.7799C18.3 14.7799 17.56 16.0599 18.47 17.6299C18.99 18.5399 18.68 19.6999 17.77 20.2199L16.04 21.2099C15.25 21.6799 14.23 21.3999 13.76 20.6099L13.65 20.4199C12.75 18.8499 11.27 18.8499 10.36 20.4199L10.25 20.6099C9.78 21.3999 8.76 21.6799 7.97 21.2099L6.24 20.2199C5.33 19.6999 5.02 18.5299 5.54 17.6299C6.45 16.0599 5.71 14.7799 3.9 14.7799C2.85 14.7799 2 13.9199 2 12.8799Z"
                stroke="currentColor"
                stroke-width="2"
                stroke-miterlimit="10"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
            </svg>
            Cài đặt</router-link
          >
        </li>
      </ul>
    </div>
  </div>
</template>

<script>
import { defineComponent, computed } from 'vue'
import { useRoute, useRouter } from 'vue-router'
import { useUserStore } from '@/stores'
export default defineComponent({
  setup() {
    const userStore = useUserStore()
    const route = useRoute()
    const router = useRouter()

    const isActive = name => {
      return route.name === name
    }

    const isAdmin = computed(() => {
      return userStore.user?.roles.some(role => role.name === 'ROLE_ADMIN')
    })

    const isStore = computed(() => {
      return userStore.user?.roles.some(role => role.name === 'ROLE_STORE')
    })

    const isShipper = computed(() => {
      return userStore.user?.roles.some(role => role.name === 'ROLE_SHIPPER')
    })

    return { userStore, route, router, isActive, isAdmin, isStore, isShipper }
  }
})
</script>

<style scoped>
.side-bar {
  @apply w-64 fixed top-0 left-0 bottom-0 bg-whiteColor border-r border-borderColor overflow-auto;
}

.side-bar ul li {
  @apply rounded-lg;
}

.side-bar ul li a {
  @apply mb-1 flex items-center justify-start gap-2 p-3 font-bold cursor-pointer transition-all duration-300;
}

.side-bar ul li svg {
  width: 22px;
  height: 22px;
  color: #adb5bd;
}

.side-bar ul li:hover {
  @apply bg-[#e9ecef];
}

.side-bar ul li.active {
  @apply bg-bgSidebarActiveColor;
}

.side-bar ul li.active svg {
  @apply text-primaryColor;
}

.side-bar li:not(.active):hover a {
  transform: translateX(4px);
}

.side-bar li:hover button {
  transform: translateX(4px);
}
</style>
